In [62]:
import pandas as pd
df = pd.read_csv('climate_data.csv')
df

        day  temperature  windspeed     event
0  1/1/2017           32          6      Rain
1  1/2/2017       -99999          7     Sunny
2  1/3/2017           28     -99999      Snow
3  1/4/2017       -99999          7  no event
4  1/5/2017           32     -99999      Rain
5  1/6/2017           31          2     Sunny
6  1/6/2017           34     -88888  no event

In [63]:
#replace -99999 with 0 (old value, new value)
df.replace(-99999,0)

        day  temperature  windspeed     event
0  1/1/2017           32          6      Rain
1  1/2/2017            0          7     Sunny
2  1/3/2017           28          0      Snow
3  1/4/2017            0          7  no event
4  1/5/2017           32          0      Rain
5  1/6/2017           31          2     Sunny
6  1/6/2017           34     -88888  no event

In [64]:
#replace -99999 with NaN
import numpy as np
df.replace(-99999,np.nan)

        day  temperature  windspeed     event
0  1/1/2017         32.0        6.0      Rain
1  1/2/2017          NaN        7.0     Sunny
2  1/3/2017         28.0        NaN      Snow
3  1/4/2017          NaN        7.0  no event
4  1/5/2017         32.0        NaN      Rain
5  1/6/2017         31.0        2.0     Sunny
6  1/6/2017         34.0   -88888.0  no event

In [65]:
#replace -99999 and -88888 with NaN
df.replace([-99999, -88888], np.nan)

        day  temperature  windspeed     event
0  1/1/2017         32.0        6.0      Rain
1  1/2/2017          NaN        7.0     Sunny
2  1/3/2017         28.0        NaN      Snow
3  1/4/2017          NaN        7.0  no event
4  1/5/2017         32.0        NaN      Rain
5  1/6/2017         31.0        2.0     Sunny
6  1/6/2017         34.0        NaN  no event

In [66]:
#if we want we can specific keyword arguments
df.replace(to_replace = [-99999, -88888], value = np.nan)

        day  temperature  windspeed     event
0  1/1/2017         32.0        6.0      Rain
1  1/2/2017          NaN        7.0     Sunny
2  1/3/2017         28.0        NaN      Snow
3  1/4/2017          NaN        7.0  no event
4  1/5/2017         32.0        NaN      Rain
5  1/6/2017         31.0        2.0     Sunny
6  1/6/2017         34.0        NaN  no event

In [67]:
#we can also specify the columns to replace values and specific what to replace with eg. this case np.nan
df.replace({
    'temperature' : -99999,
    'windspeed' : [-99999, -88888],
    'event' : 'no event'
}, np.nan)

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0    NaN
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        NaN    NaN

In [68]:
#in all columns whenever we find -99999, -88888, no event replace them with given value
df.replace({
    -99999 : np.nan,
    -88888 : np.nan,
    'no event' : 'sunny day'
})

        day  temperature  windspeed      event
0  1/1/2017         32.0        6.0       Rain
1  1/2/2017          NaN        7.0      Sunny
2  1/3/2017         28.0        NaN       Snow
3  1/4/2017          NaN        7.0  sunny day
4  1/5/2017         32.0        NaN       Rain
5  1/6/2017         31.0        2.0      Sunny
6  1/6/2017         34.0        NaN  sunny day

In [69]:
df = pd.DataFrame({
    'score' : ['exceptional', 'average', 'good', 'poor', 'average', 'exceptional'],
    'student' : ['rob', 'maya', 'parthiv', 'monica', 'julian', 'erica']
})
df

         score  student
0  exceptional      rob
1      average     maya
2         good  parthiv
3         poor   monica
4      average   julian
5  exceptional    erica

In [70]:
#replace(old value, new value)
df.replace(['poor', 'average', 'good', 'exceptional'], [1,2,3,4])

C:\Users\fasil\AppData\Local\Temp\ipykernel_17528\734960209.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.replace(['poor', 'average', 'good', 'exceptional'], [1,2,3,4])

   score  student
0      4      rob
1      2     maya
2      3  parthiv
3      1   monica
4      2   julian
5      4    erica